samples/ITI-18_request_raw.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:ns0="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0"
  xmlns:wsa="http://www.w3.org/2005/08/addressing"
  xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
  xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
  xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0"
  xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion">
  <soapenv:Header>
    <wsa:To soapenv:mustUnderstand="1">https://epd-test.ith-icoserve.com:7443/Registry/services/RegistryService</wsa:To>
    <wsa:MessageID soapenv:mustUnderstand="1">urn:uuid:31D7E4B5-C117-481E-9EE1-F32849E81BF8</wsa:MessageID>
    <wsa:Action soapenv:mustUnderstand="1">urn:ihe:iti:2007:RegistryStoredQuery</wsa:Action>
    <wsse:Security>
      <saml2:Assertion xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema" ID="_ffb617d7-4529-4c00-9a23-3c02a398d6fd" IssueInstant="2020-09-22T11:18:57.712Z" Version="2.0">
        <saml2:Issuer>http://ith-icoserve.com/eHealthSolutionsSTS</saml2:Issuer>
        <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
          <ds:SignedInfo>
            <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
            <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
            <ds:Reference URI="#_ffb617d7-4529-4c00-9a23-3c02a398d6fd">
              <ds:Transforms>
                <ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
                <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                  <ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xsd"/>
                </ds:Transform>
              </ds:Transforms>
              <ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/>
              <ds:DigestValue>bgFEghK5r3y1m8/yyQTByxqpgMfzeHKx3ieYDlClbpY=</ds:DigestValue>
            </ds:Reference>
          </ds:SignedInfo>
          <ds:SignatureValue>
Ei5YNjKluF9TqG4l0qQPvr9Y1p250gC2Xyv4VVN4saZUScX3O4/z7YGSrScEWCgHzDICZ+sK3Nhw IvQMF0yR5lFAsGor5YgsfpffmdAuwO6BKtX5ZausL0rmYMoXgiPcGrDEAKw1irh0g78m4aWqClIJ d+0rICubQ82V22w+8DSMgCXPelua4hsrhpucULHsmfV2D1Sea64gx0+LlPZGUpYLv4b+6351MG70 kZZSowp7izxk7sKtECD35RyW01FbAqdd1Q34lAIVr2LXwGeKyJsauCtxVeG9ZdWmH/o2k6KwLIcf fXZuuDPKbfxk15dZQmZzVdaFD1ru95f9A2yQMw==
          </ds:SignatureValue>
          <ds:KeyInfo>
            <ds:X509Data>
              <ds:X509Certificate>MIID5jCCA0+gAwIBAgICANYwDQYJKoZIhvcNAQENBQAwRTELMAkGA1UEBhMCQ0gxDDAKBgNVBAoM
A0lIRTEoMCYGA1UEAwwfZWhlYWx0aHN1aXNzZS5paGUtZXVyb3BlLm5ldCBDQTAeFw0xOTExMTkw
NjE3MDBaFw0yOTExMTkwNjE3MDBaMDIxCzAJBgNVBAYTAkFUMRUwEwYDVQQKDAxJVEggaWNvc2Vy
dmUxDDAKBgNVBAMMA1NUUzCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBANc8txP/o03W
4+5FAzBsHGjT+2gKaWX4HgrMNWEmpavTaYPe8v7T8jYqvZbOHqdEYsZt4IflQSORpr9CM/Cbrd7y
WzwQ3fTs5bmIsFedAiRxSMli5d/7oBx0cwKv31OHzrB39PfkQstBKAm05qapY6H2mnf6yyWKCjbF
++YdQcsUVoTAAMwAIFFseDQEarCGAoD5Nd7rCeqasMVvTFobMxGhqntgiGlJbY+hNFyxz6dfVFtf
sTlHDdfqsak9Coj6DrSharBNHOg6RRiNvc3vJ/xUDWPtS+wjddz2hWiauh5xB+VA+cSu+QkCeM2c
f2yKV0FCV91dqSw2//sXCaaEP/8CAwEAAaOCAXIwggFuMEIGA1UdHwQ7MDkwN6A1oDOGMWh0dHBz
Oi8vY3RzLXBvc3Qua2VyZXZhbC5jb20vZ3NzL2NybC8yMi9jYWNybC5jcmwwQAYJYIZIAYb4QgEE
BDMWMWh0dHBzOi8vY3RzLXBvc3Qua2VyZXZhbC5jb20vZ3NzL2NybC8yMi9jYWNybC5jcmwwQAYJ
YIZIAYb4QgEDBDMWMWh0dHBzOi8vY3RzLXBvc3Qua2VyZXZhbC5jb20vZ3NzL2NybC8yMi9jYWNy
bC5jcmwwDAYDVR0TAQH/BAIwADAdBgNVHQ4EFgQUOZlov/TXB6YHUyMV1yWK2qjG0BswHwYDVR0j
BBgwFoAUKJfv3d4xWGxW8oZG4hHkPjhxXy8wDgYDVR0PAQH/BAQDAgTwMBEGCWCGSAGG+EIBAQQE
AwIF4DAzBgNVHSUELDAqBggrBgEFBQcDAgYIKwYBBQUHAwQGCisGAQQBgjcUAgIGCCsGAQUFBwMB
MA0GCSqGSIb3DQEBDQUAA4GBAIVAG7X24vwje17fcDshobEQ6SOV43JYYTUx5bfB6PRbiJOb8Kv9
2Ijs9o9JAuol1tisQ0LZX/ddEqZ02i3gw4HsC5PSX3pTvndbhRxC6qL9fGu8x2FJ2W3Os/au5WNP
VnLkX60dKe+2aMydlWxKAJiGZE10ppMXOV9GlVIiHysp</ds:X509Certificate>
            </ds:X509Data>
          </ds:KeyInfo>
        </ds:Signature>
        <saml2:Subject>
          <saml2:NameID Format="urn:oasis:names:tc:SAML:2.0:nameid-format:persistent" NameQualifier="urn:gs1:gln">9801003538489</saml2:NameID>
          <saml2:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:bearer">
            <saml2:SubjectConfirmationData InResponseTo="Assertion_7e0e90273a10caaa6dca336825ad40c38ad35c25" NotOnOrAfter="2020-09-22T11:33:57.712Z" Recipient="https://epdtest.arts.local:8549/ACS"/>
          </saml2:SubjectConfirmation>
        </saml2:Subject>
        <saml2:Conditions NotBefore="2020-09-22T11:18:56.712Z" NotOnOrAfter="2020-09-22T11:33:57.712Z">
          <saml2:AudienceRestriction>
            <saml2:Audience>urn:e-health-suisse:token-audience:all-communities</saml2:Audience>
          </saml2:AudienceRestriction>
        </saml2:Conditions>
        <saml2:AuthnStatement AuthnInstant="2020-09-22T11:18:57.712Z">
          <saml2:AuthnContext>
            <saml2:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:PasswordProtectedTransport</saml2:AuthnContextClassRef>
          </saml2:AuthnContext>
        </saml2:AuthnStatement>
        <saml2:AttributeStatement>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization">
            <saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xsd:string">Post CH AG</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:organization-id">
            <saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xsd:anyURI">urn:oid:1.3.6.1.4.1.21367.2017.2.6.19.100.2</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:subject-id">
            <saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xsd:string">Sarah Stone</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:subject:role">
            <saml2:AttributeValue>
              <Role xmlns="urn:hl7-org:v3"
                xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" code="HCP" codeSystem="2.16.756.5.30.1.127.3.10.6" codeSystemName="eHealth Suisse EPR Actors" displayName="Healthcare professional" xsi:type="CE"/>
            </saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xspa:1.0:subject:purposeofuse">
            <saml2:AttributeValue>
              <hl7:PurposeOfUse xmlns:hl7="urn:hl7-org:v3" code="EMER" codeSystem="2.16.756.5.30.1.127.3.10.5" codeSystemName="eHealth Suisse Verwendungszweck" displayName="Notfallzugriff"/>
            </saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:oasis:names:tc:xacml:2.0:resource:resource-id">
            <saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xsd:token">761337610410098484^^^SPID&amp;2.16.756.5.30.1.127.3.10.3&amp;ISO</saml2:AttributeValue>
          </saml2:Attribute>
          <saml2:Attribute Name="urn:ihe:iti:xca:2010:homeCommunityId" NameFormat="urn:oasis:names:tc:SAML:2.0:attrname-format:uri">
            <saml2:AttributeValue xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="xsd:anyURI">urn:oid:1.3.6.1.4.1.21367.2017.2.6.19</saml2:AttributeValue>
          </saml2:Attribute>
        </saml2:AttributeStatement>
      </saml2:Assertion>
    </wsse:Security>
  </soapenv:Header>
  <soapenv:Body>
    <ns0:AdhocQueryRequest>
      <ns0:ResponseOption returnType="ObjectRef" returnComposedObjects="true"/>
      <rim:AdhocQuery id="urn:uuid:14d4debf-8f97-4251-9a74-a90016b0af0d">
        <rim:Slot name="$XDSDocumentEntryStatus">
          <rim:ValueList>
            <rim:Value>('urn:oasis:names:tc:ebxml-regrep:StatusType:Approved')</rim:Value>
          </rim:ValueList>
        </rim:Slot>
        <rim:Slot name="$XDSDocumentEntryPatientId">
          <rim:ValueList>
            <rim:Value>'7e1c6e78-58f1-4a43-ae88-0d5a5c4ab43e^^^&amp;1.3.6.1.4.1.21367.2017.2.5.45&amp;ISO'</rim:Value>
          </rim:ValueList>
        </rim:Slot>
      </rim:AdhocQuery>
    </ns0:AdhocQueryRequest>
  </soapenv:Body>
</soapenv:Envelope>
